{
    "users": [
        {
            "username": "123",
            "password": "123",
            "search_history": [
                {
                    "id": "1c7fe4d9-463c-4961-9ef4-04cd5e94cac9",
                    "query": "hi",
                    "response": "I'm sorry, I don't have information on that topic. Please try asking something about mental health.",
                    "timestamp": "2025-03-12 22:11:07"
                },
                {
                    "id": "88c96f17-ac5f-479e-8661-ad258e41a4ac",
                    "query": "ok",
                    "response": "I'm sorry, I don't have information on that topic. Please try asking something about mental health.",
                    "timestamp": "2025-03-12 22:11:18"
                },
                {
                    "id": "0565a2c4-2919-4744-87ba-1f8baf3a285a",
                    "query": "tesion",
                    "response": "I'm sorry, I don't have information on that topic. Please try asking something about mental health.",
                    "timestamp": "2025-03-12 22:11:25"
                },
                {
                    "id": "c8f6f423-baa9-46e6-8b2a-4a92793961b1",
                    "query": "depression",
                    "response": "Self-help resources are not a substitute for diagnosis or treatment. If you have concerns about low mood, it’s best to talk to your doctor first and rule out physical causes for your symptoms. However, once you’ve checked in with your doctor, self-help materials can be a great way to learn more about depression and practice different skills at your own pace or in between treatment sessions. Here are some resources to check out. \n The Antidepressant Skills Workbook was created by two BC psychologists. You’ll learn more about depression, learn and practice different skills to help improve your mood, and learn how healthy changes in other parts of your life can impact your mood. They also have similar workbooks for specific groups: \n Dealing With Depression: Antidepressant Skills for Teens \n A workbook for people who experience problems with depression at work called Antidepressant Skills at Work: Dealing with Mood Problems in the Workplace \n A workbook for expecting or new moms called Managing Depression: A Self-help Skills Resource for Women Living With Depression During Pregnancy, After Delivery and Beyond \n A workbook for people who experience health problems called Positive Coping with Health Conditions: A Self-Care Workbook \n On the HeretoHelp site, our Managing Depression series offers three info sheets: Dealing with a Diagnosis of Depression, Working With Your Doctor for Depression, and Preventing Relapse of Depression. The series helps you be an active partner in your health care, build healthy coping skills and self-management strategies, and more. \n Often depression can affect your concentration and motivation to work through self-help materials on your own. If you’d like self-help materials with a bit of extra support from a person, Bounce Back: Reclaim Your Health is a guided self-help program for British Columbians who experience mild to moderate depression, low mood, stress, or anxiety. You can get a DVD of tips to help you recognize and manage symptoms of depression, or you can learn more in-depth skills in a series of workbooks you complete at home. You also work with a trained coach from the Canadian Mental Health Association who will offer support and advice by telephone or video conference. Bounce Back is free with a doctor’s referral. For more information, visit www.bouncebackbc.ca (If you want to access the Bounce Back materials without a coach or referral, you can do that online in BC at www.bouncebackonline.ca). \n The Mood Disorders Association of BC has a number of videos on mental health, seeking help, and other topics \n Kelty Mental Health Resource Centre also maintains a comprehensive list of websites, toolkits, books and other resources for young people and families \n Heads Up Guys offer tips and strategies for healthy living strategies for men who experience depression \n The BC Reproductive Mental Health Program of BC Mental Health and Substance Use Services has a self-management guide for women who experience postpartum depression called Coping with Depression in Pregnancy and Following the Birth. They also have a guide for Aboriginal women and their families called Celebrating the Circle of Life: coming back to Balance and Harmony \n The follow resources are based outside of BC, but they offer a lot of good information. \n MoodGYM Training Program is a web-based self-help course for people who experience depression. It is based in Australia but is available for free to anyone \n Moodjuice is a UK initiative that offers self-help workbooks, including one for depression \n There are many books and workbooks available to help people who experience depression. Talk to your mental health care team for recommendations. You can find many from your local bookstore or special bookstores specializing in mental health like Odin Books in Vancouver (you can also order online). Within British Columbia, you may also borrow books for free from the Family Support and Resource Centre at BC Children’s and Women’s Hospitals. They have many self-help and reference materials on depression for women and their partners, for parents, and for children and youth.",
                    "timestamp": "2025-03-12 22:11:37"
                },
                {
                    "id": "66208ba1-c697-44ad-8f78-ea18808fac35",
                    "query": "I know someone who appears to have such symptoms?",
                    "response": "Although this website cannot substitute for professional advice, we encourage those with symptoms to talk to their friends and family members and seek the counsel of a mental health professional. The sooner the mental health condition is identified and treated, the sooner they can get on the path to recovery.If you know someone who is having problems, don't assume that the issue will resolve itself. Let them know that you care about them, and that there are treatment options available that will help them heal. Speak with a mental health professional or counselor if you think your friend or family member is experiencing the symptoms of a mental health condition. If the affected loved one knows that you support them, they will be more likely to seek out help.",
                    "timestamp": "2025-03-12 22:11:52"
                },
                {
                    "id": "9f20e2f8-f487-43fd-96b7-ce94f4a09ebb",
                    "query": "What is mental health?",
                    "response": "Mental illnesses are health conditions that disrupt a person's thoughts, emotions, relationships, and daily functioning.",
                    "timestamp": "2025-03-12 22:27:21"
                },
                {
                    "id": "5c4144b2-6b95-4623-920a-7c85d93918e3",
                    "query": "How can I take care of my physical health?",
                    "response": "Feeling comfortable with the professional you or your child is working with is critical to the success of your treatment. Finding the professional who best fits your needs may require some research.",
                    "timestamp": "2025-03-12 22:27:37"
                },
                {
                    "id": "5ab9571a-5694-455d-833e-8de4994378d1",
                    "query": "How can I maintain social connections? What if I feel lonely?",
                    "response": "Just as there are different types of medications for physical illness, different treatment options are available for individuals with mental illness. Treatment works differently for different people. It is important to find what works best for you or your child.",
                    "timestamp": "2025-03-12 22:28:02"
                },
                {
                    "id": "3864ccaf-f042-473e-94b4-ea90feb746e5",
                    "query": "What causes mental illness?",
                    "response": "Symptoms of mental health disorders vary depending on the type and severity of the condition.",
                    "timestamp": "2025-03-13 13:47:59"
                },
                {
                    "id": "64fdfe23-1e31-4461-a4ec-91d8fe59ab79",
                    "query": "Where can I find self-help materials for depression?",
                    "response": "Feeling comfortable with the professional you or your child is working with is critical to the success of the treatment. Finding the professional who best fits your needs may require research. Start by searching for providers in your area.",
                    "timestamp": "2025-03-13 13:48:34"
                }
            ]
        }
    ]
}